In [207]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [208]:
# Read the CSV files into DataFrames.
import pandas as pd
#from pathlib import Path
from pathlib import Path
#athletic_sales_2020_path = Path('Resources/athletic_sales_2020.csv')
athletic_sales_2020_path = Path('Resources/athletic_sales_2020.csv')
#athletic_sales_2021_path = Path('Resources/athletic_sales_2021.csv')
athletic_sales_2021_path = Path('Resources/athletic_sales_2021.csv')
athletic_sales_2020_df = pd.read_csv(athletic_sales_2020_path)
athletic_sales_2021_df = pd.read_csv(athletic_sales_2021_path)

In [209]:
# Display the 2020 sales DataFrame
athletic_sales_2020_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [210]:
# Display the 2021 sales DataFrame
athletic_sales_2021_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [211]:
# Check the 2020 sales data types.
athletic_sales_2020_df.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [212]:
# Check the 2021 sales data types.
athletic_sales_2021_df.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [213]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
combined_athletic_sales_2020_2021_df = pd.concat([athletic_sales_2020_df, athletic_sales_2021_df], axis="rows").reset_index(drop=True)
combined_athletic_sales_2020_2021_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [214]:
combined_athletic_sales_2020_2021_df

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet
...,...,...,...,...,...,...,...,...,...,...,...,...
9638,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,63,47,2961,1362.06,Online
9639,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,46,56,2576,1004.64,Outlet
9640,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,52,36,1872,692.64,Online
9641,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,55,125,68750,17187.50,Outlet
9642,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,70,175,122500,42875.00,Outlet

In [215]:
# Check if any values are null.
combined_athletic_sales_2020_2021_df.isnull().sum()

retailer            0
retailer_id         0
invoice_date        0
region              0
state               0
city                0
product             0
price_per_unit      0
units_sold          0
total_sales         0
operating_profit    0
sales_method        0
dtype: int64

In [216]:
###combined_athletic_sales_2020_2021_df.dropna()

In [217]:
# Check the data type of each column
combined_athletic_sales_2020_2021_df.columns

Index(['retailer', 'retailer_id', 'invoice_date', 'region', 'state', 'city',
       'product', 'price_per_unit', 'units_sold', 'total_sales',
       'operating_profit', 'sales_method'],
      dtype='object')

In [219]:
# Convert the "invoice_date" to a datetime datatype
###converted_combined_athletic_sales_2020_2021_df.["invoice_date"] = combined_athletic_sales_2020_2021_df.loc[:,"invoice_date"].astype(datetime)
combined_athletic_sales_2020_2021_df['invoice_date'] = pd.to_datetime(combined_athletic_sales_2020_2021_df['invoice_date'])
###pd.to_datetime(df['date'])

C:\Users\des9231\AppData\Local\Temp\ipykernel_44352\2424135074.py:3: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  combined_athletic_sales_2020_2021_df['invoice_date'] = pd.to_datetime(combined_athletic_sales_2020_2021_df['invoice_date'])

In [221]:
# Confirm that the "invoice_date" data type has been changed.
print(combined_athletic_sales_2020_2021_df.dtypes)
###print(df.dtypes)

retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [222]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold". 
grouped2_sales_df = combined_athletic_sales_2020_2021_df.groupby(['region', 'state', 'city'])['units_sold']\
                                                    .agg(Total_Products_Sold=("sum"))

In [223]:
grouped2_sales_df.sort_values(by='Total_Products_Sold', ascending=False).head()

                                    Total_Products_Sold
region    state      city
Northeast New York   New York                    111954
South     Texas      Houston                      90322
West      California San Francisco                85478
                     Los Angeles                  76384
Southeast Florida    Miami                        73135

In [224]:
grouped2_sales_df.head()

                               Total_Products_Sold
region  state    city
Midwest Illinois Chicago                     25407
        Indiana  Indianapolis                26332
        Iowa     Des Moines                  23446
        Kansas   Wichita                     29463
        Michigan Detroit                     50095

#### Using `pivot_table`

In [225]:
# Show the number products sold for region, state, and city.
# Rename the "units_sold" column to "Total_Products_Sold"
# Show the top 5 results.
###pivot_df = combined_athletic_sales_2020_2021_df.pivot_table(index=(['region', 'state', 'city']).sort_value(by=\
###                'Total_Products_Sold', ascending=False), columns=['region', 'state', 'city', 'retailer', \ 
###                'retailer_id', 'product','invoice_date', 'price_per_unit', 'total_sales', 'operating_profit', \
###                'sales_method'], values='Total_Product_Sold')
renamed2_combined_athletic_sales_2020_2021_df = combined_athletic_sales_2020_2021_df.rename(columns={'units_sold':'Total_Products_Sold'})
###renamed_combined_athletic_sales_2020_2021_df
###pivot_columns = ['retailer', 'retailer_id', 'product','invoice_date']
pivot2_sales_df = renamed2_combined_athletic_sales_2020_2021_df.pivot_table(index=['region', 'state', 'city'], columns='product', \
                                                                          values='Total_Products_Sold', aggfunc=('sum'))
###pivot_df.sort_values(by='units_sold', ascending=False)
pivot2_sales_df.head()
###pivot_sales_df.sort_values(by='Total_Products_Sold', ascending=False).head()

product                        Men's Apparel  Men's Athletic Footwear  \
region  state    city
Midwest Illinois Chicago                2480                     4392
        Indiana  Indianapolis           2979                     4273
        Iowa     Des Moines             2494                     3800
        Kansas   Wichita                3498                     4688
        Michigan Detroit                6976                     8142

product                        Men's Street Footwear  Women's Apparel  \
region  state    city
Midwest Illinois Chicago                        7844             4365
        Indiana  Indianapolis                   7857             4807
        Iowa     Des Moines                     7397             4312
        Kansas   Wichita                        8454             5414
        Michigan Detroit                       11809             8903

product                        Women's Athletic Footwear  \
region  state    city
Midwest Illinois Chicago                            2741
        Indiana  Indianapolis                       2732
        Iowa     Des Moines                         2219
        Kansas   Wichita                            3277
        Michigan Detroit                            6756

product                        Women's Street Footwear
region  state    city
Midwest Illinois Chicago                          3585
        Indiana  Indianapolis                     3684
        Iowa     Des Moines                       3224
        Kansas   Wichita                          4132
        Michigan Detroit                          7509

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [226]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"
combined3_athletic_sales_2020_2021_df = combined_athletic_sales_2020_2021_df.rename(columns={'total_sales':'Total_Sales'})
###combined_athletic_sales_2020_2021_df
###renamed_combined_athletic_sales_2020_2021_df
grouped3_total_sales_df = combined_athletic_sales_2020_2021_df.groupby(['region', 'state', 'city'])['units_sold'].agg(Total_Sales=("sum")) 
###grouped_total_sales_df

###grouped_sales_df.head()
##grouped_sales_df['total_sales'].sum()
# Show the top 5 results.
grouped3_total_sales_df.sort_values(by='Total_Sales', ascending=False).head()

                                    Total_Sales
region    state      city
Northeast New York   New York            111954
South     Texas      Houston              90322
West      California San Francisco        85478
                     Los Angeles          76384
Southeast Florida    Miami                73135

#### Using `pivot_table`

In [232]:
# Show the total sales for the products sold for each region, state, and city.
# Optional: Rename the "total_sales" column to "Total Sales"
renamed3_combined_athletic_sales_2020_2021_df = combined_athletic_sales_2020_2021_df.rename(columns={'total_sales':'Total Sales'})
###renamed3_combined_athletic_sales_2020_2021_df
pivot3_total_sales_df = renamed3_combined_athletic_sales_2020_2021_df.pivot_table(index=['region', 'state', 'city'], columns='product', \
                                                                                values='Total Sales', aggfunc=('sum'))
# Show the top 5 results.
pivot3_total_sales_df.head()

##grouped_sales_df.sort_values(by="Total Sales", ascending=False).head()

###grouped_sales_df = grouped_sales_df.pivot_table(index='index', columns=['region', 'state', 'city', 'retailer', 'retailer_id', 'product','invoice_date', 
###                                            'price_per_unit', 'total_sales', 'operating_profit', 'sales_method'], values="Total Sales")

product                        Men's Apparel  Men's Athletic Footwear  \
region  state    city
Midwest Illinois Chicago             1102791                  1560270
        Indiana  Indianapolis        1176101                  1306839
        Iowa     Des Moines           928928                  1088837
        Kansas   Wichita             1405053                  1469278
        Michigan Detroit             2919107                  2900751

product                        Men's Street Footwear  Women's Apparel  \
region  state    city
Midwest Illinois Chicago                     3087951          1960895
        Indiana  Indianapolis                2709332          1926345
        Iowa     Des Moines                  2408907          1647464
        Kansas   Wichita                     2883508          2118818
        Michigan Detroit                     4526962          3786560

product                        Women's Athletic Footwear  \
region  state    city
Midwest Illinois Chicago                          924799
        Indiana  Indianapolis                     761383
        Iowa     Des Moines                       589654
        Kansas   Wichita                          980045
        Michigan Detroit                         2166103

product                        Women's Street Footwear
region  state    city
Midwest Illinois Chicago                       1160782
        Indiana  Indianapolis                   956198
        Iowa     Des Moines                     760221
        Kansas   Wichita                       1116162
        Michigan Detroit                       2325950

In [233]:
# Show the total sales for the products sold for each region, state, and city.
###grouped_sales_df['Total_Product_Sold'].sum()
# Rename the "total_sales" column to "Total Sales"
#converted_combined_athletic_sales_2020_2021_df.columns('total_sales').sum
#converted_combined_athletic_sales_2020_2021_df.rename(column="total_sales":"Total Sales")

# Show the top 5 results.
###total_sales.sort['Total_Sales', ascending=False].head()

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [237]:
# Show the total sales for the products sold for each retailer, region, state, and city.
grouped4_total_sales_df = combined_athletic_sales_2020_2021_df.groupby(['retailer', 'region', 'state', 'city'])['units_sold'].agg(total_sales=("sum")) 
###grouped4_total_sales_df

# Show the top 5 results.
grouped4_total_sales_df.sort_values(by='total_sales', ascending=False).head()

                                                  total_sales
retailer      region    state      city
West Gear     West      California San Francisco        81233
Kohl's        West      California Los Angeles          74543
Foot Locker   Northeast New York   New York             72196
Sports Direct South     Texas      Dallas               67683
Walmart       South     Texas      Houston              65072

#### Using `pivot_table`

In [239]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Optional: Rename the "total_sales" column to "Total Sales"
# Show the top 5 results.
renamed4_combined_athletic_sales_2020_2021_df = combined_athletic_sales_2020_2021_df.rename(columns={'total_sales':'Total Sales'})

pivot4_total_sales_df = renamed3_combined_athletic_sales_2020_2021_df.pivot_table(index=['retailer', 'region', 'state', 'city'], columns='product', \
                                                                                values='Total Sales', aggfunc=('sum'))
pivot4_total_sales_df.head()

product                                      Men's Apparel  \
retailer region    state         city
Amazon   Midwest   Ohio          Columbus        2567061.0
         Northeast Maine         Portland         995810.0
                   Massachusetts Boston           505574.0
                   New Hampshire Manchester      1400449.0
                   Vermont       Burlington      1862696.0

product                                      Men's Athletic Footwear  \
retailer region    state         city
Amazon   Midwest   Ohio          Columbus                  2770609.0
         Northeast Maine         Portland                  1270514.0
                   Massachusetts Boston                     650116.0
                   New Hampshire Manchester                1518938.0
                   Vermont       Burlington                2036114.0

product                                      Men's Street Footwear  \
retailer region    state         city
Amazon   Midwest   Ohio          Columbus                4464402.0
         Northeast Maine         Portland                2833398.0
                   Massachusetts Boston                  1169936.0
                   New Hampshire Manchester              2769442.0
                   Vermont       Burlington              3790013.0

product                                      Women's Apparel  \
retailer region    state         city
Amazon   Midwest   Ohio          Columbus          3268924.0
         Northeast Maine         Portland          1873499.0
                   Massachusetts Boston             870340.0
                   New Hampshire Manchester        2119434.0
                   Vermont       Burlington        2623446.0

product                                      Women's Athletic Footwear  \
retailer region    state         city
Amazon   Midwest   Ohio          Columbus                    1885400.0
         Northeast Maine         Portland                     697119.0
                   Massachusetts Boston                       405484.0
                   New Hampshire Manchester                  1070231.0
                   Vermont       Burlington                  1447437.0

product                                      Women's Street Footwear
retailer region    state         city
Amazon   Midwest   Ohio          Columbus                  1879477.0
         Northeast Maine         Portland                   941055.0
                   Massachusetts Boston                     592140.0
                   New Hampshire Manchester                1198648.0
                   Vermont       Burlington                1620757.0

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [256]:
# Filter the sales data to get the women's athletic footwear sales data.
# match name="women's athletic footwear"
women_athletic_footwear_sold_df = combined_athletic_sales_2020_2021_df.loc[combined_athletic_sales_2020_2021_df['product']=="Women's Athletic Footwear", :]
###women_athletic_footwear_df

#### Using `groupby`

In [257]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
grouped5a_women_athletic_footwear_sold_df = women_athletic_footwear_df.groupby(['retailer', 'region', 'state', 'city'])['units_sold'].agg(total_sales=("sum")) 

# Show the top 5 results.
grouped5a_women_athletic_footwear_sold_df.sort_values(by='total_sales', ascending=False).head()

                                                      total_sales
retailer      region    state          city
West Gear     West      California     San Francisco        12107
Foot Locker   Northeast New York       New York             10996
Kohl's        West      California     Los Angeles          10826
Foot Locker   Southeast South Carolina Charleston            8814
Sports Direct South     Texas          Dallas                8790

#### Using `pivot_table`

In [265]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# did. Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
# Show the top 5 results.
renamed5a_women_athletic_footwear_sold_df = women_athletic_footwear_sold_df.rename(columns={'units_sold':'Womens_Footwear_Units_Sold'})

pivot5a_total_sales_df = renamed5a_women_athletic_footwear_sold_df.pivot_table(index=['retailer', 'region', 'state', 'city'], \
                                                                                    columns='Womens_Footwear_Units_Sold', \
                                                                                    values='total_sales', aggfunc=('sum'))
pivot5a_total_sales_df.head()

Womens_Footwear_Units_Sold                   0    7    8      13   14   16   \
retailer region    state         city
Amazon   Midwest   Ohio          Columbus    NaN  NaN  NaN    NaN  NaN  NaN
         Northeast Maine         Portland    NaN  NaN  NaN  416.0  NaN  NaN
                   Massachusetts Boston      NaN  NaN  NaN    NaN  NaN  NaN
                   New Hampshire Manchester  NaN  NaN  NaN    NaN  NaN  NaN
                   Vermont       Burlington  NaN  NaN  NaN    NaN  NaN  NaN

Womens_Footwear_Units_Sold                   17     19   20     21   ...  675  \
retailer region    state         city                                ...
Amazon   Midwest   Ohio          Columbus    NaN    NaN  NaN    NaN  ...  NaN
         Northeast Maine         Portland    NaN  646.0  NaN  693.0  ...  NaN
                   Massachusetts Boston      NaN    NaN  NaN    NaN  ...  NaN
                   New Hampshire Manchester  NaN    NaN  NaN    NaN  ...  NaN
                   Vermont       Burlington  NaN    NaN  NaN    NaN  ...  NaN

Womens_Footwear_Units_Sold                   700  725  750  775  800  825  \
retailer region    state         city
Amazon   Midwest   Ohio          Columbus    NaN  NaN  NaN  NaN  NaN  NaN
         Northeast Maine         Portland    NaN  NaN  NaN  NaN  NaN  NaN
                   Massachusetts Boston      NaN  NaN  NaN  NaN  NaN  NaN
                   New Hampshire Manchester  NaN  NaN  NaN  NaN  NaN  NaN
                   Vermont       Burlington  NaN  NaN  NaN  NaN  NaN  NaN

Womens_Footwear_Units_Sold                   850  900  925
retailer region    state         city
Amazon   Midwest   Ohio          Columbus    NaN  NaN  NaN
         Northeast Maine         Portland    NaN  NaN  NaN
                   Massachusetts Boston      NaN  NaN  NaN
                   New Hampshire Manchester  NaN  NaN  NaN
                   Vermont       Burlington  NaN  NaN  NaN

[5 rows x 217 columns]

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [281]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
# Optional: Rename the "total_sales" column to "Total Sales"
# Show the table.
renamed5b_women_athletic_footwear_sold_df = women_athletic_footwear_sold_df.rename(columns={'total_sales':'Total Sales'})

renamed5b_women_athletic_footwear_sold_df['invoice_date'] = combined_athletic_sales_2020_2021_df['invoice_date']
###renamed5b_women_athletic_footwear_sold_df

pivot5b_total_sales_df = renamed5b_women_athletic_footwear_sold_df.pivot_table(index='invoice_date', columns='product', \
                                                                                values='Total Sales', aggfunc=('sum'))
pivot5b_total_sales_df

product       Women's Athletic Footwear
invoice_date
2020-01-04                       402743
2020-01-05                       141801
2020-01-11                       129556
2020-01-17                       173013
2020-01-22                       388250
...                                 ...
2021-12-22                       200406
2021-12-23                       808022
2021-12-24                       190885
2021-12-25                       315175
2021-12-30                       167903

[355 rows x 1 columns]

In [290]:
# Resample the pivot table into daily bins, and get the total sales for each day. 
resampled5b_pivot5b_total_sales_df = pivot5b_total_sales_df.resample('D').sum()
# Sort the resampled pivot table in ascending order on "Total Sales".
resampled5b_pivot5b_total_sales_df['Total Sales'] = pivot5b_total_sales_df["Women's Athletic Footwear"]

resampled5b_pivot5b_total_sales_df.sort_values(by='Total Sales')

product       Women's Athletic Footwear  Total Sales
invoice_date
2020-11-07                         8974       8974.0
2020-11-01                         8974       8974.0
2021-05-30                        15406      15406.0
2021-10-27                        17916      17916.0
2021-02-03                        19210      19210.0
...                                 ...          ...
2021-12-14                            0          NaN
2021-12-26                            0          NaN
2021-12-27                            0          NaN
2021-12-28                            0          NaN
2021-12-29                            0          NaN

[727 rows x 2 columns]

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [293]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
# Sort the resampled pivot table in ascending order on "Total Sales".
resampled6_pivot5b_total_sales_df = pivot5b_total_sales_df.resample('W').sum()

resampled6_pivot5b_total_sales_df['Total Sales'] = pivot5b_total_sales_df["Women's Athletic Footwear"]

resampled6_pivot5b_total_sales_df.sort_values(by='Total Sales')

product       Women's Athletic Footwear  Total Sales
invoice_date
2020-11-01                       398128       8974.0
2021-05-30                      1055137      15406.0
2021-10-31                       253555      20983.0
2020-12-13                        58916      26922.0
2021-03-21                      1290523      40972.0
...                                 ...          ...
2021-08-29                      1485963          NaN
2021-09-26                      1108370          NaN
2021-11-28                      1150272          NaN
2021-12-26                      1719976          NaN
2022-01-02                       167903          NaN

[105 rows x 2 columns]